Smokescreen5gh/hovercraft-code/esp32-projects/12 Fan Experiment/src/transmitter.cpp
#include <Arduino.h>
#include <SPI.h>
#include <nRF24L01.h>
#include <RF24.h>

#include <Wire.h>
#include <Adafruit_GFX.h>
#include <Adafruit_SSD1306.h>

#include "NRF_Radio.h"
#include "POT.h"

// NRF24L01 pins
#define PIN_SCK   18
#define PIN_MISO  19
#define PIN_MOSI  23
#define PIN_CSN   5
#define PIN_CE    17

// OLED pins
#define SCREEN_WIDTH 128
#define SCREEN_HEIGHT 64
#define OLED_RESET -1
#define OLED_I2C_ADDRESS 0x3C

#define SDA_PIN 21
#define SCL_PIN 22

// One potentiometer only
#define POT_PIN 27

static const uint8_t RADIO_RX_ADDR[6] = "00001";
static const uint8_t RADIO_TX_ADDR[6] = "00002";

NrfRadio radio(PIN_CE, PIN_CSN, RADIO_RX_ADDR, RADIO_TX_ADDR, 1);
Adafruit_SSD1306 display(SCREEN_WIDTH, SCREEN_HEIGHT, &Wire, OLED_RESET);
Potentiometer pot(POT_PIN, "Throttle Pot");

static uint16_t throttleUs = 1000;
static float rxStaticPa = 0.0f;
static float rxVenturiPa = 0.0f;
static float rxCFM = 0.0f;
static char rxMotorState = 'D';

void setup() {
  Serial.begin(115200);
  delay(200);

  Serial.println("Starting NRF24 Transmitter...");

  pot.begin();

  Wire.begin(SDA_PIN, SCL_PIN);

  if (!display.begin(SSD1306_SWITCHCAPVCC, OLED_I2C_ADDRESS)) {
    while (true) delay(1000);
  }

  display.clearDisplay();
  display.setTextColor(SSD1306_WHITE);
  display.setTextSize(1);
  display.setCursor(0, 0);
  display.println("Fan Tester TX");
  display.display();
  delay(1000);

  radio.begin();
  Serial.println("Radio initialized.");
}

void loop() {
  radio.serviceConnection();

  RadioPayload in{};
  bool gotPacket = radio.receivePackage(in);

  if (gotPacket && in.type == PacketType::TELEMETRY) {
    rxStaticPa = in.staticPa;
    rxVenturiPa = in.venturiPa;
    rxCFM = in.cfm;
    rxMotorState = in.motorState;
    throttleUs = in.throttleUs;
  }

  pot.update();
  uint16_t potRaw = pot.getValue();
  throttleUs = map(potRaw, 0, 4095, 1000, 2000);

  static uint32_t lastControlMs = 0;
  if (millis() - lastControlMs >= 20) {
    lastControlMs = millis();

    RadioPayload out{};
    out.type = PacketType::CONTROL;
    out.potRaw = potRaw;
    out.throttleUs = throttleUs;

    radio.sendPackage(out);
  }

  static uint32_t lastSerialMs = 0;
  if (millis() - lastSerialMs >= 250) {
    lastSerialMs = millis();

    Serial.print("Pot: ");
    Serial.print(potRaw);
    Serial.print(" | Throttle: ");
    Serial.print(throttleUs);
    Serial.print(" | Static: ");
    Serial.print(rxStaticPa, 1);
    Serial.print(" Pa | Venturi: ");
    Serial.print(rxVenturiPa, 1);
    Serial.print(" Pa | CFM: ");
    Serial.print(rxCFM, 1);
    Serial.print(" | Motor: ");
    Serial.println(rxMotorState);
  }

  static uint32_t lastOledMs = 0;
  if (millis() - lastOledMs >= 100) {
    lastOledMs = millis();

    display.clearDisplay();
    display.setTextSize(1);
    display.setTextColor(SSD1306_WHITE);

    display.setCursor(0, 0);
    display.print("NRF Module TX");

    display.setCursor(0, 9);
    display.print(radio.isConnected() ? "Connected" : "Disconnected");

    display.setCursor(0, 18);
    display.print("SA:");
    display.write((const char*)RADIO_TX_ADDR, 5);
    display.print(" RA:");
    display.write((const char*)RADIO_RX_ADDR, 5);

    display.setCursor(0, 28);
    display.print("Pot:");
    display.print(potRaw);
    display.print(" PWM:");
    display.print(throttleUs);

    display.setCursor(0, 38);
    display.print("S:");
    display.print(rxStaticPa, 1);
    display.print(" V:");
    display.print(rxVenturiPa, 1);

    display.setCursor(0, 48);
    display.print("CFM:");
    display.print(rxCFM, 1);
    display.print(" M:");
    display.print(rxMotorState);

    display.display();
  }
}